In [1]:
import numpy as np
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
import os

In [4]:
os.getcwd()

'D:\\tutorials\\2021 Python for Machine Learning & Data Science Masterclass\\2021 Python for Machine Learning & Data Science Masterclass\\00 My codes\\pandas'

In [5]:
pwd

'D:\\tutorials\\2021 Python for Machine Learning & Data Science Masterclass\\2021 Python for Machine Learning & Data Science Masterclass\\00 My codes\\pandas'

In [6]:
df = pd.read_csv('ext-data\\example.csv',index_col=0)

In [7]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [8]:
df.to_csv('newfile.csv',index=False)

In [9]:
new = pd.read_csv('newfile.csv')

In [10]:
new

    b   c   d
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15

### HTML tables to Pandas

In [11]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [12]:
tables = pd.read_html(url)

In [13]:
len(tables)

30

In [14]:
tables[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1927,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",123,33,14,13,12,12,11,15,20

In [15]:
tables[7]

   Rank                 Country  Population  Area(km2)  Density(pop/km2)
0     1               Singapore     5921231        719              8235
1     2              Bangladesh   165650475     148460              1116
2     3  Palestine[note 3][103]     5223000       6025               867
3     4          Taiwan[note 4]    23580712      35980               655
4     5             South Korea    51844834      99720               520
5     6                 Lebanon     5296814      10400               509
6     7                  Rwanda    13173730      26338               500
7     8                 Burundi    12696478      27830               456
8     9                   India  1389637446    3287263               423
9    10             Netherlands    17400824      41543               419

In [16]:
tables[7].columns

Index(['Rank', 'Country', 'Population', 'Area(km2)', 'Density(pop/km2)'], dtype='object')

In [17]:
dens_topten = tables[7]

In [18]:
dens_topten

   Rank                 Country  Population  Area(km2)  Density(pop/km2)
0     1               Singapore     5921231        719              8235
1     2              Bangladesh   165650475     148460              1116
2     3  Palestine[note 3][103]     5223000       6025               867
3     4          Taiwan[note 4]    23580712      35980               655
4     5             South Korea    51844834      99720               520
5     6                 Lebanon     5296814      10400               509
6     7                  Rwanda    13173730      26338               500
7     8                 Burundi    12696478      27830               456
8     9                   India  1389637446    3287263               423
9    10             Netherlands    17400824      41543               419

In [19]:
dens_topten = dens_topten.drop('Rank',axis=1)

In [20]:
dens_topten

                  Country  Population  Area(km2)  Density(pop/km2)
0               Singapore     5921231        719              8235
1              Bangladesh   165650475     148460              1116
2  Palestine[note 3][103]     5223000       6025               867
3          Taiwan[note 4]    23580712      35980               655
4             South Korea    51844834      99720               520
5                 Lebanon     5296814      10400               509
6                  Rwanda    13173730      26338               500
7                 Burundi    12696478      27830               456
8                   India  1389637446    3287263               423
9             Netherlands    17400824      41543               419

In [21]:
pwd

'D:\\tutorials\\2021 Python for Machine Learning & Data Science Masterclass\\2021 Python for Machine Learning & Data Science Masterclass\\00 My codes\\pandas'

In [22]:
ls

 Volume in drive D has no label.
 Volume Serial Number is 9F42-8A93

 Directory of D:\tutorials\2021 Python for Machine Learning & Data Science Masterclass\2021 Python for Machine Learning & Data Science Masterclass\00 My codes\pandas

03/26/2024  05:19 PM    <DIR>          .
03/26/2024  05:19 PM    <DIR>          ..
03/23/2024  02:48 PM    <DIR>          .ipynb_checkpoints
03/20/2024  02:35 PM            45,764 Combining-Dataframe.ipynb
03/25/2024  09:22 PM    <DIR>          ext-data
03/11/2024  08:46 PM           135,564 GroupBy-operations.ipynb
03/26/2024  05:19 PM            43,745 Input and output.ipynb
03/11/2024  03:40 PM            40,070 Missing-values.ipynb
03/26/2024  05:21 PM                40 newfile.csv
03/06/2024  08:11 AM            56,241 pandas-conditional-filtering.ipynb
03/05/2024  06:09 PM           161,253 pandas-dataframe.ipynb
03/08/2024  07:38 PM           154,275 pandas-methods.ipynb
03/03/2024  07:49 PM             7,704 pandas-series.ipynb
03/26/2024  05:18 PM             1,519 sample.html
03/20/2024  03:04 PM             8,407 text-methods.ipynb
03/20/2024  09:52 PM            36,350 Time-methods.ipynb
              12 File(s)        690,932 bytes
               4 Dir(s)  21,495,345,152 bytes free

In [23]:
dens_topten.to_html('sample.html')

In [24]:
ls

 Volume in drive D has no label.
 Volume Serial Number is 9F42-8A93

 Directory of D:\tutorials\2021 Python for Machine Learning & Data Science Masterclass\2021 Python for Machine Learning & Data Science Masterclass\00 My codes\pandas

03/26/2024  05:19 PM    <DIR>          .
03/26/2024  05:19 PM    <DIR>          ..
03/23/2024  02:48 PM    <DIR>          .ipynb_checkpoints
03/20/2024  02:35 PM            45,764 Combining-Dataframe.ipynb
03/25/2024  09:22 PM    <DIR>          ext-data
03/11/2024  08:46 PM           135,564 GroupBy-operations.ipynb
03/26/2024  05:19 PM            43,745 Input and output.ipynb
03/11/2024  03:40 PM            40,070 Missing-values.ipynb
03/26/2024  05:21 PM                40 newfile.csv
03/06/2024  08:11 AM            56,241 pandas-conditional-filtering.ipynb
03/05/2024  06:09 PM           161,253 pandas-dataframe.ipynb
03/08/2024  07:38 PM           154,275 pandas-methods.ipynb
03/03/2024  07:49 PM             7,704 pandas-series.ipynb
03/26/2024  05:21 PM             1,519 sample.html
03/20/2024  03:04 PM             8,407 text-methods.ipynb
03/20/2024  09:52 PM            36,350 Time-methods.ipynb
              12 File(s)        690,932 bytes
               4 Dir(s)  21,495,345,152 bytes free

In [25]:
df = pd.read_excel('ext-data\\my_excel_file.xlsx', sheet_name='First_Sheet')

In [26]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
wb = pd.ExcelFile('ext-data\\my_excel_file.xlsx')

In [28]:
wb.sheet_names

['First_Sheet']

In [29]:
exl_sheet_dict = pd.read_excel('ext-data\\my_excel_file.xlsx', sheet_name=None)

In [30]:
type(exl_sheet_dict)

dict

In [31]:
exl_sheet_dict.keys()

dict_keys(['First_Sheet'])

In [32]:
exl_sheet_dict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
temp_db = create_engine('sqlite:///:memory:')

In [34]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)), columns=['a', 'b', 'c', 'd'])

In [35]:
df

    a   b   c   d
0  53  30  89  54
1  80  86  57  17
2  88  93  39  19
3  39   2  63  82

In [36]:
df.to_sql(name='new_table', con=temp_db)

In [37]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [38]:
new_df

   index   a   b   c   d
0      0  53  30  89  54
1      1  80  86  57  17
2      2  88  93  39  19
3      3  39   2  63  82

In [39]:
pd.read_sql_query(sql="SELECT a,c FROM new_table", con=temp_db)

    a   c
0  53  89
1  80  57
2  88  39
3  39  63

In [40]:
temp_db

Engine(sqlite:///:memory:)